## `Business Understanding`

This dataset provides insights into data engineer salaries and employment attributes for the year 2024. It includes information such as salary, job title, experience level, employment type, employee residence, remote work ratio, company location, and company size.

The dataset allows for analysis of salary trends, employment patterns, and geographic variations in data engineering roles. It can be used by researchers, analysts, and organizations to understand the evolving landscape of data engineering employment and compensation.

##### **Null Hypothesis (H0):** There are no significant differences in salaries among the groups (levels) of the factor being tested.


##### **Alternative Hypothesis (H1):** There are significant differences in salaries among the groups (levels) of the factor being tested.

## `Data Understanding`
Feature Description:
##### **work_year:** The year in which the data was collected (2024).


##### **experience_level:** The experience level of the employee, categorized as SE (Senior Engineer), MI (Mid-Level Engineer), or EL (Entry-Level Engineer).


##### **employment_type:** The type of employment, such as full-time (FT), part-time (PT), contract (C), or freelance (F).


##### **job_title:** The title or role of the employee within the company, for example, AI Engineer.

##### **salary:** The salary of the employee in the local currency (e.g., 202,730 USD).


##### **salary_currency:** The currency in which the salary is denominated (e.g., USD).


##### **salary_in_usd:** The salary converted to US dollars for standardization purposes.

##### **employee_residence:** The country of residence of the employee.


##### **remote_ratio:** The ratio indicating the extent of remote work allowed in the position (0 for no remote work, 1 for fully remote).


##### **company_location:** The location of the company where the employee is employed.

##### **company_size:** The size of the company, often categorized by the number of employees (S for small, M for medium, L for large).

##### **Analytical Questions**

1. How is salary spread? What's the mean, standard deviation, and median?

2. Can a salary trend be observed amongst data science roles?
3. In which country do data specialists earn the highest?
4. Which job title is paid the most?
5. How does experience affect the salary?

# Loading the data

In [28]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import rcParams

In [29]:
df = pd.read_csv('salaries.csv')

In [30]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M

# Exploring the data

### Data cleaning

In [31]:
# Is the data clean?
print(df.isna().sum(),"\n----------------------------------------------") # Are there any missing values?
print(df.duplicated().sum()," Duplicates\n----------------------------------------------") # Are there any duplicaetes?
df.info() # Is data type for each column valid?

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64
----------------------------------------------
6421  Duplicates
----------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16534 non-null  int64
 1   experience_level    16534 non-null  object
 2   employment_type     16534 non-null  object
 3   job_title           16534 non-null  object
 4   salary              16534 non-null  int64
 5   salary_currency     16534 non-null  object
 6   salary_in_usd       16534 non-null  int64
 7   employee_residence  16534 non-null  object
 8   remote_ratio        16534 non-null  int64
 9   company_location    16534 non-null  object
 10  company_size        16534 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.4+ MB

df.describe

In [6]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
work_year,16534.0,2023.226866,0.713558,2020.0,2023.0,2023.0,2024.0,2024.0
salary,16534.0,163726.962683,340205.744183,14000.0,101763.0,142200.0,187200.0,30400000.0
salary_in_usd,16534.0,149686.777973,68505.293156,15000.0,101125.0,141300.0,185900.0,800000.0
remote_ratio,16534.0,32.003750,46.245158,0.0,0.0,0.0,100.0,100.0

In [24]:
df.shape

(16534, 11)

In [25]:
df.nunique()

work_year                5
experience_level         4
employment_type          4
job_title              155
salary                2560
salary_currency         23
salary_in_usd         2939
employee_residence      88
remote_ratio             3
company_location        77
company_size             3
dtype: int64

In [32]:
# drop salary and salary_currency not nessessary 
df.drop(['salary','salary_currency'], axis=1, inplace=True)

In [33]:
# Optimizing the data
df[['experience_level','employment_type','job_title','employee_residence','company_size']] = df[['experience_level','employment_type','job_title','employee_residence','company_size']].astype('category')

In [34]:
# Taking closer look at the duplicates
df[df.duplicated(keep=False)].sort_values(by='salary_in_usd').head(25)

# It might be that a company hires multiple people for a position.
# Hence, I will assume that the duplicates are an expected occurrence.
# However, to get more precise image of the salaries I'm going to exclude the duplicates
# to obtain salary per position per company.
df.drop_duplicates(inplace=True)

In [35]:
# Locations of companies
df['company_location'].unique()

array(['US', 'AU', 'GB', 'CA', 'NL', 'LT', 'DK', 'FR', 'ZA', 'NZ', 'AR',
       'ES', 'KE', 'LV', 'IN', 'DE', 'IL', 'FI', 'AT', 'BR', 'CH', 'AE',
       'PL', 'SA', 'UA', 'EG', 'PH', 'TR', 'OM', 'MX', 'PT', 'BA', 'IT',
       'AS', 'IE', 'EE', 'MT', 'HU', 'LB', 'RO', 'VN', 'NG', 'LU', 'GI',
       'CO', 'SI', 'GR', 'MU', 'RU', 'KR', 'CZ', 'QA', 'GH', 'SE', 'AD',
       'EC', 'NO', 'JP', 'HK', 'CF', 'SG', 'TH', 'HR', 'AM', 'PK', 'IR',
       'BS', 'PR', 'BE', 'ID', 'MY', 'HN', 'DZ', 'IQ', 'CN', 'CL', 'MD'],
      dtype=object)

In [36]:
df['job_title'].unique()

# There are over 155 job titles! Let's limit the research to the top 10 most frequent job titles.

['AI Engineer', 'Data Engineer', 'Machine Learning Engineer', 'ML Engineer', 'Data Analyst', ..., 'Principal Data Architect', 'Data Analytics Engineer', 'Cloud Data Architect', 'Lead Data Engineer', 'Principal Data Analyst']
Length: 155
Categories (155, object): ['AI Architect', 'AI Developer', 'AI Engineer', 'AI Product Manager', ..., 'Software Data Engineer', 'Staff Data Analyst', 'Staff Data Scientist', 'Staff Machine Learning Engineer']

In [16]:
top_10_titles = df['job_title'].value_counts().iloc[:10]
top_10_titles

Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
Applied Scientist             435
Data Architect                435
Analytics Engineer            431
Research Engineer             306
Data Science                  271
Name: job_title, dtype: int64

In [18]:
top_10_data = df.loc[df.job_title.isin(top_10_titles.index)]
top_10_data.job_title.unique()
# Now I've got a dataframe with with the top 10 most frequent job titles

['Data Engineer', 'Machine Learning Engineer', 'Data Analyst', 'Data Scientist', 'Applied Scientist', 'Data Architect', 'Research Scientist', 'Data Science', 'Analytics Engineer', 'Research Engineer']
Categories (155, object): ['AI Architect', 'AI Developer', 'AI Engineer', 'AI Product Manager', ..., 'Software Data Engineer', 'Staff Data Analyst', 'Staff Data Scientist', 'Staff Machine Learning Engineer']

In [19]:
top_10_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13332 entries, 2 to 16531
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           13332 non-null  int64
 1   experience_level    13332 non-null  category
 2   employment_type     13332 non-null  category
 3   job_title           13332 non-null  category
 4   salary              13332 non-null  int64
 5   salary_currency     13332 non-null  object
 6   salary_in_usd       13332 non-null  int64
 7   employee_residence  13332 non-null  category
 8   remote_ratio        13332 non-null  int64
 9   company_location    13332 non-null  object
 10  company_size        13332 non-null  category
dtypes: category(5), int64(4), object(2)
memory usage: 815.8+ KB

In [12]:
# hypothesis: salary

import statsmodels.api as sm
from statsmodels.formula.api import ols

# Define threshold
threshold = 0.05

# Perform ANOVA for each factor
factors = ['experience_level', 'employment_type', 'remote_ratio', 'company_size']
p_values = {}

for factor in factors:
    # Fit ANOVA model
    model = ols('salary_in_usd ~ {}'.format(factor), data=df).fit()
    anova_table = sm.stats.anova_lm(model, typ=2)
    
    # Extract p-value
    p_value = anova_table['PR(>F)'][0]
    
    # Convert p-value to decimal
    p_value_decimal = round(float(p_value), 2)
    print(p_value_decimal)
    
    # Store p-value
    p_values[factor] = p_value_decimal

# Compare p-values against threshold
significant_factors = [factor for factor, p_value in p_values.items() if p_value < threshold]

print("Significant factors with p-values below {}: {}".format(threshold, significant_factors))

0.0
0.0
0.0
0.0
Significant factors with p-values below 0.05: ['experience_level', 'employment_type', 'remote_ratio', 'company_size']